"""
Each new term in the Fibonacci sequence is generated by adding the previous two terms.
By starting with 1 and 2, the first 10 terms will be:
1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...
By considering the terms in the Fibonacci sequence whose values do not exceed four million,
find the sum of the even-valued terms.

Search for Fibonacci numbers, check for parity and summation.
The answer is 4613732

--- 0.0 seconds --- (ryzen 2600)

Каждый следующий элемент ряда Фибоначчи получается при сложении двух предыдущих.
Начиная с 1 и 2, первые 10 элементов будут:
1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...
Найдите сумму всех четных элементов ряда Фибоначчи, которые не превышают четыре миллиона.

Поиск чисел фибоначи, проверка на четность и суммирование.
Ответ - 4613732

--- 0.0 seconds --- (ryzen 2600)
"""

import time

start_time = time.time()

a = 0
b = 1
c = 0
x = 0
while c <= 4000000:
    c = a + b
    a = b
    b = c
    if a % 2 == 0:
        x += a

print(x)

print("--- %s seconds ---" % (time.time() - start_time))
